{"sz-challenge-00": "LSTM-based model trained on the CHB-MIT dataset.", "sz-challenge-01": "Convolution-Transformer model trained on the CHB-MIT, TUH EEG Seizure,  Siena Scalp EEG and private-sourced datasets.", "sz-challenge-02": "XGBoost model trained on the Siena Scalp EEG and TUH EEG Seizure datasets.", "sz-challenge-03": "XGBoost model trained on the Siena Scalp EEG and TUH EEG Seizure datasets.", "sz-challenge-04": "XGBoost model trained on the Siena Scalp EEG and TUH EEG Seizure datasets.", "sz-challenge-05": "Based on pre-trained LaBraM model fine-tuned and refined on the Siena Scalp EEG, TUH EEG Seizure and TUH EEG datasets.", "sz-challenge-06": "Random Forest Classifier trained on the CHB-MIT datasets.", "sz-challenge-07": "Convolutional Neural Network trained on the CHB-MIT datasets.", "sz-challenge-08": "Hyena Hierarchy-based model trained on the TUH EEG Corpus.", "sz-challenge-09": "Hyena Hierarchy-based model trained on the TUH EEG Seizure Corpus.", "sz-challenge-10": "EEGWavenet-based model trained on the CHB-MIT, Siena Scalp EEG and TUH EEG Seizure  datasets.", "sz-challenge-11": "Convolution, Network-in-Network, Residual Connections and Transformer model trained on the  Siena Scalp EEG and TUH EEG Seizure datasets.", "sz-challenge-12": "U-Net based model trained on the TUH EEG Seizure and KU Leuven SeizeIT2 datasets.", "sz-challenge-13": "Combination of convolutions and transformer architecture trained on the TUH EEG Seizure Corpus.", "sz-challenge-14": "EEG-transformer model trained on the TUH EEG Seizure and TUH EEG datasets.", "sz-challenge-15": "Joint Embedding Predictive Architecture trained on the TUH EEG Seizure corpus.", "sz-challenge-16": "Joint Embedding Predictive Architecture trained on the TUH EEG Seizure corpus.", "sz-challenge-17": "Joint Embedding Predictive Architecture trained on the TUH EEG Seizure corpus.", "sz-challenge-18": "Spectral-feature-based algorithm developed on the Siena Scalp EEG dataset.", "sz-challenge-19": "Transformer-encoder with LSTM train on the Siena Scalp EEG and TUH EEG Seizure datasets.", "sz-challenge-20": "Event-based classification trained on the TUH EEG Seizure corpus.", "sz-challenge-21": "Multiscale convolutional neural network trained on the CHB-MIT dataset.", "sz-challenge-22": "Convolutions followed by a trasnformer trained on the TUH EEG Seizure Corpus.", "sz-challenge-23": "Model based on the S4 backbone trained on the TUH EEG Seizure Corpus.", "sz-challenge-24": "Model based on the S4 backbone trained on the TUH EEG Corpus.", "sz-challenge-25": "Model based on the S4 backbone trained on the TUH EEG Seizure Corpus.", "sz-challenge-26": "Hilbert-Huang Transform followed by AlexNet trained on the CHB-MIT dataset and  data colelcted by the Iranian Center of Neurological Research.", "sz-challenge-27": "LRU-based architecture trained on the TUH EEG Seizure corpus.", "sz-challenge-28": "TCN-GRU architecture trained on the CHB-MIT dataset.", "sz-challenge-29": "Model based on the pre-trained LaBraM model finetuned on the Siena Scalp EEG, TUH EEG Seizure and TUH EEG datasets."}